[
  {
    "id": "doc-1",
    "title": "Getting Started with MCP Power",
    "path": "docs/getting-started.md",
    "content": "MCP Power is a Model Context Protocol server that provides semantic search capabilities over knowledge datasets. To get started, install the package and configure your datasets directory.",
    "snippet": "MCP Power is a Model Context Protocol server that provides semantic search capabilities..."
  },
  {
    "id": "doc-2",
    "title": "Configuring Datasets",
    "path": "docs/datasets.md",
    "content": "Each dataset requires a manifest.json file with metadata including id, name, description, and paths to the index and metadata files. The index contains FAISS embeddings for semantic search.",
    "snippet": "Each dataset requires a manifest.json file with metadata including id, name, description..."
  },
  {
    "id": "doc-3",
    "title": "Using the Search Tool",
    "path": "docs/tools/search.md",
    "content": "The knowledge.search tool accepts a dataset ID, a natural language query, and an optional topK parameter. It returns relevant documents with similarity scores, titles, paths, and snippets.",
    "snippet": "The knowledge.search tool accepts a dataset ID, a natural language query, and an optional topK..."
  },
  {
    "id": "doc-4",
    "title": "Listing Available Datasets",
    "path": "docs/tools/list-datasets.md",
    "content": "Use the knowledge.listDatasets tool to discover all registered datasets. This tool returns metadata for each ready dataset including name, description, and default topK value.",
    "snippet": "Use the knowledge.listDatasets tool to discover all registered datasets..."
  },
  {
    "id": "doc-5",
    "title": "Troubleshooting Common Issues",
    "path": "docs/troubleshooting.md",
    "content": "Common issues include: dataset not found errors (check manifest.json), slow search performance (verify FAISS index size), and Python bridge failures (ensure dependencies are installed).",
    "snippet": "Common issues include: dataset not found errors, slow search performance, Python bridge failures..."
  }
]
